pilot_case/PILOT-LH2-001/openfoam_wallBoiling_base/constant/thermophysicalProperties.gas
/* NIST SRD 69 saturation-derived parahydrogen properties; see source registry. */
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object thermophysicalProperties.vapor;
}
thermoType
{
    type heRhoThermo;
    mixture pureMixture;
    transport tabulated;
    thermo hTabulated;
    equationOfState icoTabulated;
    specie specie;
    energy sensibleEnthalpy;
}
mixture
{
    specie
    {
        nMoles 1;
        molWeight 2.01588;
    }
    equationOfState
    {
        // NIST saturation vapor density interpolation; use only within the declared saturation range.
        rho
        (
            (21.010 1.6229)
            (21.510 1.839)
            (22.010 2.0757)
            (22.510 2.3346)
            (23.010 2.6173)
            (23.510 2.9256)
            (24.010 3.2616)
            (24.510 3.6275)
            (25.010 4.0261)
            (25.510 4.4602)
            (26.010 4.9335)
            (26.510 5.45)
            (27.010 6.0147)
            (27.510 6.6335)
            (28.010 7.3141)
            (28.510 8.0656)
            (29.010 8.9006)
            (29.510 9.8355)
            (30.010 10.894)
            (30.510 12.11)
            (31.010 13.539)
            (31.510 15.28)
            (32.010 17.546)
            (32.510 20.975)
        );
    }
    thermodynamics
    {
        Hf 0;
        Sf 0;
        Cp
        (
            (21.010 12354)
            (21.510 12607)
            (22.010 12890)
            (22.510 13206)
            (23.010 13560)
            (23.510 13958)
            (24.010 14407)
            (24.510 14915)
            (25.010 15493)
            (25.510 16153)
            (26.010 16914)
            (26.510 17798)
            (27.010 18836)
            (27.510 20070)
            (28.010 21558)
            (28.510 23387)
            (29.010 25688)
            (29.510 28668)
            (30.010 32677)
            (30.510 38359)
            (31.010 47036)
            (31.510 61924)
            (32.010 93358)
            (32.510 202070)
        );
    }
    transport
    {
        mu
        (
            (21.010 1.0317e-06)
            (21.510 1.0602e-06)
            (22.010 1.0892e-06)
            (22.510 1.1186e-06)
            (23.010 1.1485e-06)
            (23.510 1.1792e-06)
            (24.010 1.2105e-06)
            (24.510 1.2428e-06)
            (25.010 1.2761e-06)
            (25.510 1.3106e-06)
            (26.010 1.3465e-06)
            (26.510 1.384e-06)
            (27.010 1.4234e-06)
            (27.510 1.4651e-06)
            (28.010 1.5095e-06)
            (28.510 1.5572e-06)
            (29.010 1.6091e-06)
            (29.510 1.666e-06)
            (30.010 1.7295e-06)
            (30.510 1.8019e-06)
            (31.010 1.8868e-06)
            (31.510 1.991e-06)
            (32.010 2.1292e-06)
            (32.510 2.3483e-06)
        );
        kappa
        (
            (21.010 0.017573)
            (21.510 0.018185)
            (22.010 0.018816)
            (22.510 0.019468)
            (23.010 0.020144)
            (23.510 0.020845)
            (24.010 0.021575)
            (24.510 0.022338)
            (25.010 0.023137)
            (25.510 0.023979)
            (26.010 0.02487)
            (26.510 0.02582)
            (27.010 0.026839)
            (27.510 0.027943)
            (28.010 0.029152)
            (28.510 0.030494)
            (29.010 0.032009)
            (29.510 0.033756)
            (30.010 0.035826)
            (30.510 0.038368)
            (31.010 0.041651)
            (31.510 0.046215)
            (32.010 0.053406)
            (32.510 0.068487)
        );
    }
}
